IDENTIFICATION DIVISION.
PROGRAM-ID. CallHelloWorld.

PROCEDURE DIVISION.
MAIN-PROGRAM.
    CALL "HelloWorld"
    DISPLAY "Returned from HelloWorld program."
    STOP RUN.